{
  "transaction_ready_provisionals": {
    "video_id": "pLf4HC8BJks",
    "title": "How to Write a Transaction-Ready Provisional Patent Application",
    "author": "Steve Key - inventRight",
    "url": "https://youtu.be/pLf4HC8BJks",
    "key_concepts": [
      "Transaction-ready provisional",
      "Overcoming three arguments (licensees, examiners, infringers)",
      "Know your point of difference",
      "Manufacturing and materials",
      "Workarounds and variations",
      "Stealing from yourself",
      "Drawings tell the story"
    ],
    "transcript": "today I'm going to talk about how to protect your invention I'm going to show you some great things to do to write that provisional patent application that truly has value so stay tuned [Music] all right everybody some people don't even know what a provisional patent application is so let's start at the very beginning and this here the slide I'm showing you here basically tells you what it is and I found that on Wikipedia but in my language my terms I'm going to tell you when you have an invention this is the first thing you should do to put that stake in the ground to give you that first date that hey I've got something new I've got something novel and I'm going to start to protect it it's a great tool it's called a provisional patent application we also call it a PPA okay so what is the provisional patent application right you guys in simple terms you have an idea it's new and novel and you want to start to protect it you're going to file a provisional patent application it's called a PPA it gives you that first date that you came up with an idea because you want to claim to the world you're the true inventor okay so what are the benefits of a provisional patent application well first of all it lets you test the market to see if anybody even cares it also gives you the time to investigate it's a very low cost tool but the great thing about it is when you file the first one you don't have all the answers there's a very good chance you're going to discover new things and you're going to have to file another one so this allows you to file the first one and you can file multiple ppas during that year because it's a year long and you can bring them all together and combine them right at the end of the year of the first date of that first filing wow it's a great testing tool if you went ahead and filed a non-provisional patent application that gets expensive that could be in the tens of thousands of dollars and if you had new information you would have to file another one so a provisional patent application is a great tool to test ideas it gives you patent pending status for one year and it's extremely affordable so during this video I'm going to show you how to write a provisional patent application that really has value and no one's going to show you how to do this no patent attorney is going to show you how to do this you need to learn to do this yourself the reason why no one's going to help you do this is going to take too much time and energy and money and you cannot afford for them to do the work you need to do so let me show you how to create a provisional patent application that I call transaction ready that is going to have value not only to an investor to a potential licensee to anybody it's actually going to protect your invention but also the Innovation and you can use it as a selling tool so what is a transaction ready provisional patent application it's a document that shows that you know what you're talking about it's a document that when someone sees it it establishes trust because you're taking away fear you're taking away risk that's why it's so important to do this correctly all right this is the part I love the most if you write a provisional patent application the correct way it's going to overcome future arguments this is the part that's really important you have to understand if you write your provisional patent application correctly in which I term transaction ready is going to overcome three future arguments the first argument when you show your invention to a to a potential licensee a company that's looking for ideas or you show it to a potential investor they're going to look at it the first thing they're going to say is why are we paying you because maybe there's some similar ideas out there maybe there's some prior patents out there if you write it this way and they look at it they're going to see this and go wow you did a good job we understand we should pay you so that's the first argument that's why you have to do this correctly the second argument if you file this correctly that it's a transaction provisional patent application a year later when you file the non-provisional patent application the real patent which costs a lot of money you're going to be submitting that to the USPTO and a pad examiner is going to get it his job is to find the priorit his job is to look at it and find things out there to reject your claims and if you follow this the right way you have a better chance of getting your patent issued so that's that second argument you're going to overcome that patent examiner why he's going to reject your patent application let me show you how to overcome that argument all right okay here we go the third argument infringement copycats you know those guys they're trying to steal your idea if you follow that advice I've given you now there's a very good chance you're going to make it a very very compelling argument of why they should not copy your idea all right so the big benefit when you write it this way it's a selling tool but it overcomes potential arguments so what's really great about this you guys I like to look at provisional patent applications as a selling tool yes you want to protect your invention and I'm going to show you how to protect the Innovation but I'm going to show you how to write it so it actually sells your invention it's a selling tool I'm going to show you how so how do you write a transaction ready provisional patent application you need to be a detective you need to gather information together you need to be curious but you need to write this in such a way that anybody could read it and understand it it needs to be clear it needs to be just so easy for people to put themselves in this situation to really understand the problem and that's the first thing the problem describe it in such a way that anybody can understand the problem you're talking about you want them to to feel like they're there they observe it they see it so that's the first thing you need to do now the second your Solution that's your invention okay you need to also describe your point of difference and we'll talk more about that in a minute in such a way that your solution to this problem your invention is very clearly stated right don't make it complicated make it very easy for anybody to understand all right the next Manufacturing in materials most applications do not include this information and I think that's a big mistake most patents are not worth anything because they don't include this information now how do you get manufacturing and material information because most of us don't know how to do it well you need to watch how your product could potentially be made because if they can't make it no one's going to pay you anything so how do you do that well you can watch YouTube uh channels on information of how your things are being made you could visit a manufacturing facility you can even hire an ex-employee of some of these companies and and understand how your idea could be implemented and you could hire these people ex-employees you can find them on LinkedIn it's not hard to do have them sign an NDA with work for hire language so whatever they tell you you own but if you can't include this type of information in your provisional patent application it truly has value and no one does that you need to do that okay next there's the big one here's the big one you need to include workarounds and variations workarounds and variations what does that mean that means you need to steal it from yourself right you need to come up with how how many different ways could they someone could come up with my idea it's pretty simple when you think about it if you steal it from yourself not only are you protecting your invention but you're really trying to protect the Innovation and when you do it this way you're blocking others just do to not file or you know something that's a little different than yours you're trying to get broad protection and and it's very important to do that okay next thing and I'll talk a little bit more about that in just a minute too tell a story and you do that with drawings a drawing is worth a thousand words and if you if you do a lot of drawings good line drawings they don't have to be patent drawings but good line drawings that really tell the story it makes it makes it easier for people to understand your provisional patent application guess what you've just wrote it in such a way with all this information it's transaction ready someone could take it and they can implement it you've answered all their questions you've taken away all their concerns you've reduced some risk and you've told a great story that's what you need to do okay let's talk about that first thing I talked about knowing your point of difference and how do you do that you're going to do that doing a Google image search a Google shopping search and you can do that looking for prior prior patents prior art what you're really trying to do is is look at the roadblocks the the road bumps out ahead because your product will hit those roadblocks if you don't know what's out ahead and if you know it's out of heavy if you really know your point of difference compared to everything else out there you're going to overcome those arguments specially with investors potential licensees but really with that patent examiner so you must know your point of difference manufacturing you look at the slide here James is going to show you this is a product that I'm involved in called fishbone the equipment to put on this piece of cardboard with basically six holes runs at very high speeds in fact it's it's built with robotics now what do I know about manufacturing things like this not much but I know how to get the information I know how to find the right companies that can help me get that information and put that in my provisional patent application right so now it truly has value how do you make it so to find out how to manufacture it a couple things you can do go on the internet that go to the manufacturing facility find the experts also know all the materials too all right I'm going to show you in fact I need to give you kind of an idea about how to expand certain words that talk about maybe work around the variations here's a quick example if I have a new let's say a bag I have a new bag to put things in and this bag has a velcro closure I could open it and close it because it has velcro well if I'm going to expand the way I'm thinking about this if I want to put in workarounds and variations I might say look it could be velcro it could be a snap it could be a hook it could be a zipper in fact it could be any closing medical it could be any mechanical closing device wow it just went from narrow too broad but guess what what if I said anyway to couple and uncouple those two sides for me to get in it and close it up I just included everything you could possibly think about those are the type of words that when you include in your provisional patent application protects not only your invention but the Innovation technical drawings hey look you could also send a photograph you could even you know scribble notes and finally file it at the provisional patent application but just because you could shoot you know you shouldn't use nice line drawings call out exactly what you want people to understand make it so easy for people to see exactly what you're trying to do for them to exactly can see what your invention is I also include a couple workarounds and variations because when I do that I understand that a picture is worth a thousand words and it's really important to show your Brilliance show your invention so include a lot of drawings okay you guys real quick right I'm going to recap it again transaction ready provisional patent notification how do you do it first of all know the problem make it so simple anybody can understand the solution that's your invention make sure everybody's clear and you know your point of difference but material manufacturing really really important of course the workarounds the variations you got to steal it from yourself and the drawings a drawings worth a thousand words when you put this all together now you can tell a story that's all it really is it's telling a very compelling story that's going to overcome arguments make it very clear very simple for people to understand and now it's a great selling tool so when you create a provisional patent application that's transaction ready you've done something most people will never do in fact what you've done you've created a tool to sell to license your invention so what are the benefits I want to talk about once again it's going to help you get potential licensees interested it's going to overcome arguments it's going to get people that want to license it from you it's going to help protect it it's going to provide confidence for some of the work with you but you know what it also does it allows you if you want to start a company to bring a team together because you know what you're talking about all right I'm going to go through some of the benefits you guys when you do it this way when you start when you create a transaction ready provisional patent application it takes away risks it provides a clear roadmap app answers all the questions overcomes the arc the obstacles it covers all aspects of your intellectual property it gives people confidence to move forward with you increases your chances to obtain an issued patent stops potentially infringement and not only protects your invention but now it protects your Innovation all right now I went through a lot of information here and I know for a lot of you it's going to be holy cow Steve this is really overwhelming if you need help make sure to reach out to me you can reach out to me reach out to invent right we can help you also we have a great program called smart IP that when you combine this great information with the software that helps you write it it's going to be fantastic and it's extremely affordable okay subscribe down below if you like this video I will see you next time [Music] thank you"
  },
  "software_provisionals": {
    "video_id": "aQo8g8NijbA",
    "title": "How to Draft Software/Computer Provisional Patent Applications",
    "author": "Patent Attorney",
    "url": "https://youtu.be/aQo8g8NijbA",
    "key_concepts": [
      "Focus on HOW not WHAT",
      "Write in plain engineer language",
      "System diagrams and flowcharts",
      "Method steps are most important",
      "Describe variations and alternatives",
      "Detailed description is 95% of effort",
      "Avoid patent attorney writing style"
    ],
    "transcript": "As a patent attorney with over 20 years of experience, I've seen a lot of clients who are intimidated and confused about how to draft a provisional patent application. So, in this video, I'm going to give you the insider techniques of how to draft a provisional application related to software or computer inventions and how to make it easy so you can maximize the benefit and protection that you get from the provisional application. So, what do I mean by computer inventions or software related inventions? For example, this could be a web page or a phone app that receives data, sends it to a server, gets a response, and presents an output to a user. It could be something also like a standalone product such as a robotic system or an appliance that operates primarily locally via software or firmware. So, obviously, some of these systems have physical components. So, check out my video as well related to drafting provisional patent applications on physical inventions. So, let's start off with some basics about provisional patent applications to make sure that we're all on the same page. So, there's two ways to start the patent process. One is with a non-provisional patent application, and this is the full formal application that should be attorney drafted, has all the formal requirements, tends to be pretty expensive, and this is the application you file at the USPTO, and it waits in line for 1 to 3 years before examination begins. And then it starts a negotiation with the examiner where you're trying to convince the examiner that what you have is new and non-obvious over the prior art and you're trying to get the broadest claims possible. So this back and forth can go on for a long time. It could be months, sometimes years, and hopefully your application is allowed eventually and then we'll issue as a patent. So the other way to start the process, and what we're going to be talking about today, is with a provisional patent application. Provisional patent applications are just a placeholder. They only last for one year. They automatically expire at the end of the year and that term cannot be extended. Now, one of the most important things to understand about provisional patent applications is that you only get credit for what you actually disclose in the application. The USPTO is literally going to accept pretty much anything that you file and will slap patent pending on that and will give you a filing date. But it's completely possible that you could file a provisional patent application and it's going to be totally worthless. I've seen this a lot of times where people just have a one paragraph abstract, this tiny little disclosure, and yes, they can get a filing date on it and technically they're patent pending, but that is absolutely worthless and gives them no protection. Now, even if you do a good job and have a lot of description, especially with computer and software related inventions, it's especially tricky. I've seen people with very detailed descriptions of the of the how the software works or how the hardware works or how the overall network or system works, but at the same time, they don't have the right details. And yeah, while they have a lot of content, it's the wrong content and so it doesn't really give them all that much protection and it makes the provisional kind of worthless. Now, when learning how to draft a provisional patent application, it's pretty much as important to understand what not to focus on as to what to actually focus on. And this is a big issue I see with a lot of folks is, like I said, they draft these huge descriptions, but it has the the wrong details and they focus on the wrong things and they spend all their energy on stuff that is effectively worthless. So, the first thing I notice a lot of times is people trying to write like a patent attorney. That's a huge mistake and it's a lot of effort in trying to have a certain style when that style doesn't really help with patentability. Yes, it's fun to try to draft like a like like a patent and use that language, but you're not going to get a lot of benefit. You should save your energy and your effort for things that are actually going to give you some protective benefit. Some other things that I see a lot of times that people are spending their time on are things like the title, the field of the invention, the background, or the claim section. So with the title, do not agonize over the title. I've talked to some people where they say, \"Oh, you know, I've I've gone back and forth on the title and we we spent all this time workshopping it.\" Like, do not spend that time that it's wasted time. I I'll tell you later on the things that you want to focus on. Similar, you'll see in non-provisional patent applications, they have the field of invention. Again, this is not required for provisional patent applications. Don't spend any time on it. It's not required. Um, and especially if you're going to be agonizing over something like this, save your effort for something else. Another thing, and this is especially a counterintuitive one, is the background section. I see a lot of people who sometimes they'll spend more time on the background section than the actual detailed description. And really, the background section doesn't really give you a lot of benefit. The main target audience for the background section is going to be people like investors and people who don't know about patents who are reading the patent application. Especially in a provisional, which is not substantly examined at all, it doesn't really matter having a background. And if anything, backgrounds can actually be used against you. So, anything that you have in the background is admitted prior art. And so, a lot of times, I'll leave a background section out or keep it very, very basic. And later on, I'm going to give you some uh suggestions on how to do the background section, right? The next one is claims. Now, claims for one, they are not required in a provisional patent application. And this is another place where I see people trying to write like a patent attorney. have a good time drafting these claims, but they're effectively worthless. There's no benefit to having claims in a provisional patent application, aside from one little asterk that I'll discuss later on, but it's not something you should spend a lot of time on. I see a lot of folks who spend all this time trying to craft these claims and and trying to write like a patent attorney. And usually that's going to be worthless and they spend more time on this than drafting the detailed description, which is the most important thing. Another thing is perfect drawings. And while having good drawings is important, they don't need to be absolutely perfect. So a mistake that people make is they spend all this time learning how to do something on CAD and they have to have these perfect drawings, submit hours and hours and hours when they could have done things really quickly just sketching things out by hand or sketching things out on a on the computer in a basic kind of way. Drawings don't need to be absolutely perfect. And one thing I tell people a lot of times is I would rather have a bunch of sketches that are really crappy and janky than one super perfect really nice drawing. So don't spend too much time on these things. Focus on what's really important which is the detailed description. So then what are the things you should actually be focusing on if you want to draft a provisional application and make it easy while also getting the most protection and getting the best filing date possible. So the first thing is instead of trying to write like a patent attorney and learn how to do that, write in the plain language of an engineer or a developer and write in language that you would understand or someone like that would understand. Now the true standard is it just needs to be such that one of ordinary skill in the art that being your average person who works in the field can make and use the invention based on your description. So that you know that that that's the mistake a lot of people make is they try to draft like a patent and you use all this flowery language but they should really write in their own voice especially for people who know about software who know about computer systems. Write in language that you understand. That should be the target voice. that is so much easier than trying to write in this new contrived kind of way. Write in your own language and it's going to be so much easier for you. So a good example as far as like what information you want to provide and on what level think if you had to outsource development of your product and you had to give a guide to somebody that if they were an engineer right or a software developer someone like that if they could make the invention and use it based off of that description without having to give you any without having to ask you for any more information. What would that guide be? What were the what would the basic things that a software engineer would need to have to be able to make and use your invention? Now, another critical thing especially for software and computer related inventions is focusing on how the system works and not just what it is. This is the biggest mistake I see folks make when they're drafting their own provisional applications related to software and computer technology. They say, \"Hey, this thing is so much better and has this functionality. Does this and it happens faster and here's the hardware it's running on. It's it's so much better and has these functionalities.\" But that's kind of worthless. It's not about what the system does. It's about how it does that. And I'll talk a bit later about how to actually get protective value and how to cover the how instead of just the what. So then for computer and software inventions what's going to be most important is going to be the method that is performed to create the functionalities of the software product or the system. So for instance you have an interface and input is received and then what happens then like where is that input sent where is that data sent to say it goes to a server what processing goes on at the server side how is that data processed does it go to other systems or is it just directly sent back to the to the the user device and then what happens at the user device how is that presented at at at the user device. It's going to be those methods that are going to be most important to patentability. Now, when it comes to drafting the provisional application, a lot of times it can be easy to start with the figures as a base. So, when it comes to drafting figures or drawings for your patent application, you want to be telling a story of how the invention works. And I like to start at the very beginning, the the basics. So, one is sort of a network diagram. So, for instance, you have your your system. Is it something that is connected to the internet? How is it connected? Is it via network? Does it talk to a server? Are there a group of servers? What devices are involved in this system? A lot of times it's not just going to be the user device is going to be a back-end server. There could be other components. Um, talk about sort of the basics of the device. Sometimes this is a really simple thing. It's just going to be a device and a server connected via network. Other times it can be more complex and sort of have a general diagram of that. Next is if you have something that has an interface, have an example of what that interface is. Maybe you haven't built it. that's totally fine. But just sketch out a basic understanding of what the interface is so that you can tell that story of how do users interact with this? What are the buttons? Things like that. What sort of uh in information is being input. Another thing I like to have is swim or data flow diagrams. And I'll show some examples of those here. Those can be helpful in understanding how data is obtained, what sort of data is obtained, where does it go, how is it processed down the road, say on the server side, what goes on there, and then what data is sent back to the user device. Those can be really helpful in understanding the flow of data in the system. Also, method diagrams um and this is uh how data is processed. So you a lot of times you'll have these method steps and I'll provide you some examples here of what uh method diagrams look like but really you know it can be really simple it can be complex just make sure that if you start getting this really really huge diagram with a lot of method steps try to break it up into multiple multiple figures if it's too complex now these are just some examples of things that I find to be useful in drafting invention disclosures or provisional patent patent applications or non-provisional patent applications related to computer software and computer hardware technology. But if these things are difficult, if you've never seen these before, if you're not comfortable with this, don't feel like you need to learn how to draft these sort of figures or these diagrams. You don't want to be doing something and learning something from scratch. If these don't make sense to you, write things in a way or draw things in a way or create figures in a way that makes sense to you. There's no right way, there's no wrong way to do these things. If you don't have some of these diagrams in there, hey, it's not that big of a deal. You know, you just need to get the information out in a way that is understandable to software developers or engineers, people who work in the field. That's what's most important. It's not a specific form that it needs to be in. And these are just some examples. So, don't feel like you have to use any of these. Once you have the figures, then you're going to want to start drafting the detailed description. Now, in certain patent applications, you'll see all sorts of other things like the background, the field of invention, a summary, but what's really important is having a detailed description. Don't worry too much about having these special sections and having these things that are required. Like, that doesn't really matter that much. What really matters is the detailed description. That's where you should be focusing most of your time. So, this should really be a walkthrough of the drawing. So, start with each drawing and go into great detail about the drawing, what it shows, what the pieces are, how they're interconnected. go into great detail about each each drawing. Be sure to write in narrative form. So, don't have bullets or just don't have it be an outline. Have it be in narrative form and have a lot of detail. It's not just sort of a a summary of things, you know, just with bullet points. It should be a full description about things. So, of course, you're going to be talking about the main embodiment that you have, that being sort of the main commercial product that you have envisioned or that you're you're actually going to be coming out with, but you want to describe all sorts of variations as well. And that's how you have a really broad patent application that's going to be able to cover a lot of variations in addition to what you're looking to do. Because really, you want to cover what you're doing, but also what competitors are going to do. You want to have it so that if competitors come in the market, they can't easily design around your patent application and make little tweaks and changes to it and then suddenly they're doing something that's totally different. You want all the variations to be covered so that if competitors come out and do it, they're still going to be infringing. But similarly, and this happens a lot in product development, especially with startups, as you get it in front of customers and investors, and as as you do more R&D, your product is going to change. So, you're going to want to talk about things that you may do in the future. Think about things that are going to be better. So if price was no object, for instance, you know, if you could spend as much money as you wanted on manufacturing or or things like that, what are the things that you would do that maybe going to be the second or third generation once you've built the company more? Talk about those things now because then you're going to be able to protect them now. You can protect them well before you're doing it. You can protect them well before your competitors are doing them. Also in you you want to be thinking about things that are better and things that are that are really good, but also think about things that are second and third best. So a good example here is that let's say we have a competitor who comes out and they come out with this crappy version of what you're doing, not something that you would ever want to have. You will still want that to be protected. And so talk about ways that maybe it'll be, you know, it'll be slower or cheaper or it's, you know, for whatever reason it's not going to be as good. talk about those examples as well because if a competitor comes out and they have some crappy version that's not as good, you still want that to be covered as well so you can stop them even though it's not as good of a product. And people always say, well, but you know, I don't necessarily know what we're going to do. We don't have the specifics. Make stuff up. That's totally fine. You can come up with a lot of different examples. Brainstorm. Have a good time with it. Make things up. You can throw in as much as you want. And if you happen to then actually implement some of these things, you'll want to have that description in there. If your competitors come out and they happen to have those things in there, you're going to want to have that description in there. So, throw in the kitchen sink, come up with a lot of different variations. You are not limited to just what you're able to do now or what you know that you can do now. You can put in all sorts of fun variations. Another thing that can be really useful when drafting your provisional application is doing a walkth through of how the product is actually used in the real world. So how would somebody actually interact with it? How would they use it? And if it's a computer product, so for instance, how would you know what what goes on at the server side? So you know user is using it then data is sent to the server. what goes on there and what's what is the specific data that is being processed and then what is the output in a very specific sort of use case and with products too you know like well what are people actually going to be doing with this thing who is going to be using it is it going to be a scientist or a consumer or is it going to be uh an engineer like who are the people who are going to actually be using this and in what context tell a story that can be really helpful and these things aren't going to be limiting if you do them Right. Now, drafting the figures and the detailed description should be 95% of the effort that you're putting into the provisional patent application. So, then what is going to be that extra 5% of drafting that you're going to be doing? One is that if you have time, write a short summary of the invention sort of based on your full description and put that at the beginning of the detailed description. It can kind of be good to have a a summary up front without referring to the drawings just to kind of give somebody a little like kind of like an abstract, but put that in the detailed description as well. Also, if you have time, you can write a background section. People love to write background section because it kind of sets up the problem, but one of the important things with that is you you you're not required to have a background. It's not an essential thing that most people are going to be looking at, but a lot of times if you're going to be showing the provisional application to investors and things like that, that can really be good optics for them. IC and sort of set up the problem and what the current state of the art is. But the critical thing with the background is do not talk about your invention in the background. Anything in the background is admitted to be prior to art and can be used against you. That's why a lot of times we just skip the background section or make it really really short or high level. Don't go anything above one to two paragraphs. It's it's kind of a waste of time. Another thing is the title. And like I said, I I hear people who say, \"Well, we we like workshop the title and we're going back and forth.\" No, don't do it. you know, just just have a really quick title. I mean, really, most of the time, what we're going to do is going to be whatever it is and then just tack systems and methods onto the end. Don't put more than a a few minutes into the title. It really does not matter. It's not going to be something that's going to make any sort of difference whatsoever. And the final thing that you should not be spending much time on is the claim section. So, I did say that claims are not required in a provisional patent application, but for for purposes of foreign protection, you need to have at least one dummy claim in there. And it's really simple. I'll give you the language now. It's just the systems and methods shown and described herein. That should be it for the claims. There is a page at the end. It says claims. There is the number one. And then it just says the systems and methods described here. And that should be it. Do not spend a lot of time trying to formulate claims and draft them like a patent attorney or sound like a patent. That is a huge waste of your time and effort. Um, and the biggest mistake I see people make is with the claims is they end up putting in so much more detail in the claims that really should have been in the detailed description. Things that like aren't in the detailed description, but are just in the claims. And if they're just in the claims, they're really not supported. The support comes from the detailed description. Now claims like I said are not required in provisional applications. They nothing happens claims the the provisional application is just a placeholder. It is not examined in any substant way. It is only at the non-provisional stage that then you will have claims and then you will have to have the examination process related to those claims. So please do not waste your time on claims. It's one of those things that you know is just it's a total waste of time. You should be focusing on that detailed description because that's where protection really is. So with the full structure of the provisional application in mind, here are some additional important details that you need to be mindful of. One is the drawings must be in full black and white. And this means they cannot have grayscale. And of course, they cannot have color. It needs to be 100% black and white. So when you're drafting the drawings, pull out any sort of grayscale, pull out any sort of color. make make sure that it's going to be full true black and white because when you file the drawings of the USPTO it's going to be converted to black and white and the problem I see a lot of times is people have color or other things that is that makes it so that that's there there's understanding there and important details can be obscured and lost upon conversion at the USPTO. So make sure you have true black and white drawings that you're going to be submitting. Another thing like I said is the drawings don't have to be absolutely perfect. You can do handline drawings and as long as it's black and white, that's totally fine. I always say I would rather have a ton of drawings and figures that are crappy and handdrawn than one perfect CAD drawing that you spend hours and hours and hours on. So, the drawings can be incorporated into the description. That's totally fine. Having the drawings in line if you feel like that's helpful. But if whether or not you do that, definitely have each drawing on a separate sheet of its own in as large size as possible. The reason here is because again, you only get credit for what is actually filed. And sometimes people file the drawings and they're kind of small tiny form and the the the small details or the small text gets lost upon filing and you don't get credit for that. So even if you have stuff in line in the text document, create specific sheets with each of the drawing figures and have it fill up as much space as possible so the small details and the small text, they aren't lost. And of course, the biggest thing when drafting the provisional application is that content is way more important than form. I would have rather have way more detail and have there even be spelling mistakes and have it just be flow of consciousness than have you know maybe a page or two that is perfectly written like a patent attorney and has flowery language and things like that. It's way better to have almost informal description in narrative form than to have this perfectly craft crafted pros. So detail and more volume of detail that's going to get you more protective value. it's not in just the form of how that is provided. So, being able to draft it like a patent attorney does not help give you more protection in the provisional application. It's best to start the drafting process with just kind of a brain dump. Get all the information down on paper and then go back to refine it. So, one of the things that you don't want to have in there is limiting language. you you want to remove that once you've kind of gotten all the concepts down on paper. Now, the thing about limiting language is that it's if you have this in the provisional application and especially in the non-provisional application, it can be used against you down the road to limit your scope of protection and make it so that people can say, well, you know, you limited yourself to this very specific thing. Our product doesn't infringe because you use this specific language. Okay, so the the basics of removing limited language is don't have anything that describes the whole invention. And strangely enough, the best practice is never to use the term invention ever. Everything is just an example. It's an it's an embodiment. You never want to pin it down to say the invention is this or the invention is critically including these things or it has to do this. have everything be optional because yes that may be important in your embodiment in your commercial embodiment but a competitor may not have that and so if you limit yourself to saying this is essential this has to be in there the invention is this that can be used against you down the road and of course you want to talk about hey in some examples it can be important to do this or that but couch it in being in specific examples or specific embodiment. Now, unfortunately, limiting language is really confusing and counterintuitive and one of those things that even patent attorneys, it takes years and years and years of experience to kind of learn about these things. It's not something that is easy to describe in a lot of ways. And so, that's why a lot of times I suggest doing what I call a coached provisional patent application. And so, for instance, what I'll do is I will coach my clients on drafting invention disclosure then that then I will scrub to remove limiting language. If anything, broaden things here and there. make sure it has the right formatting, make sure it has the right detail, and then file that as a provisional patent application. That tends to be the right balance in terms of cost and and time and ROI, especially for clients that are going to be doing startups and things where it's really important. If if you definitely don't have any money, if you are on a budget or if you're just kind of doing this for fun, maybe you don't necessarily need to run it through a a patent attorney. But if you're if you but if you have a startup and it's important that you get solid protection, a lot of times doing the coach provisional can be really good. Make sure you run it by a patent attorney to make sure that you actually do have the right detail, that it's in the right form, that you don't have limiting language, and you don't have stuff in there that's going to like bite you in the ass down the road that you can't undo. Now, once you've drafted everything and removed liming language, then you want to do sort of the final formatting of things if things aren't already formatted. One is thing to keep in mind is that USPTO is going to accept pretty much anything that you file as a provisional patent application. So, you need to make sure that it's in the right form because the PTO is not going to tell you that you've screwed things up. And it's only going to be years down the road when you're trying to get priority based on this provisional application that it's going to be in litigation or enforcement that people are going to say, \"Oh, well, you actually had this limiting language in there. You know, your drawings, they were too small and you couldn't see these details, so you don't get get this priority.\" So, make sure that you have things right before you file the application. Like I said, it's great insurance to have a patent attorney do this kind of work with the coach provisional. Make sure it's in the right form. This can be especially important if you're going to be attracting investors. Investors are going to have to see this provisional application and they're going to want it to smell right and look right. And if it doesn't, they're going to be more likely to pass on you as a potential investment. Some of the simple things are to make sure that you have the same font throughout. Make sure it's at least 12 point size so that when you file it, the the small text isn't lost. And then have things with paragraph numbers. Number each paragraph. I'll kind of give you an example here. And then put the drawings if you have them in line in the text. Also have this put them in separate sheets so that the small text and you know maybe small figures and uh small little aspects of the drawings aren't lost. You want to have them on separate sheets. Then what you do is just send it to your patent attorney to file it as a provisional application or they'll do this editing for you and they'll be ready to file it or you can then just file it yourself."
  },
  "patent_strategy": {
    "video_id": "tbjUBk4HFio",
    "title": "Patent and Inventing Playbook - Complete Strategy Guide",
    "author": "Dylan Adams - Patent Attorney",
    "url": "https://youtu.be/tbjUBk4HFio",
    "key_concepts": [
      "Four types of IP",
      "Patent as exclusionary right",
      "Licensing vs selling patents",
      "Soft benefits: marketing, fear, protection",
      "New and non-obvious requirements",
      "Software patentability (how to frame)",
      "Provisional vs non-provisional strategy",
      "Ideas are patentable with details"
    ],
    "transcript": "hey pat and friends welcome back to another video this is the patent and inventing playbook and i'm going to give you all the details that i have on inventing and protecting ideas and inventions with patents and specifically how to tailor a patent strategy for your business or company so stick around we are starting right now [Music] so i'm giving a talk tomorrow at the king county bar association and this is my dry run and i want to record it for uh for all of you so let's kind of get into what we're going to be talking about so first thing is kind of what is patentable sort of where patents fit into intellectual property in general why patents are important i think people realize that patents are you know are valuable things that are important to protecting ideas and inventions but don't really necessarily realize why or at least why it why they're important for say startups for instance i'm going to give you an overview of the patent process and then talk about different patent strategies and specifically talk about patent strategies for big companies for startups for small individual inventors and people with consumer products and how those strategies differ and it's important to understand all of those because regardless of whether you're a startup or an individual inventor you know it's under it's good to understand how these different strategies are the same in some ways and how they're different in some ways so you pick the right one for you also talk a bit about patent or prior art searching whether it's something you need to do whether it's essential whether it's a stand part of the patent process also infringement analysis which is totally different than prior art or patent searching do you infringe on other people's patents is that a standard part of the eventing process and how do you navigate that also early stage issues with inventing and i'm going to talk about this is a really important thing so be sure to stay stick around to the end because i'm going to talk about how to not forfeit your patent rights inadvertently there are some important things you need to do early on to make sure you don't totally forfeit your patent rights or lose the ability to patent something altogether so that's going to be the important thing kind of at the end so for those of you who are new here my name is dylan adams i'm a patent attorney author of the best-selling book patents demystified which is an insider's guide to protecting ideas and inventions um also you may recognize me from my appearance on cnbc's hit show the prophet with marcus lemonis so my practice as a patent attorney is focused on patent prosecution and that's sort of a fancy way of saying i focus on doing patent strategy so determining how to structure a patent portfolio what inventions to protect drafting and filing patent applications following those at the united states patent trademark office and working them through the examination process hopefully until they issue as a patent i do a bit of consulting as well related to infringement litigation so whether it's defense or offense but mostly it's going to be the patent prosecution that is you know crafting patent portfolios and drafting patent applications so as a patent attorney i have to understand technology as well if not better than my client so i have a master's in electoral engineering an undergrad degree in biochemistry molecular biology um and so you know it's you know those are the important things to be able to understand the inventions as well as clients all right so let's go ahead and get right into it so patents are one of four types of ip or intellectual property so you can see here so there's patents copyrights trademarks and trade secrets patents and copyrights in a lot of ways are kind of diametrically opposed patents cover utilitarian things whereas copyrights are going to cover artistic works okay trademarks are kind of off on their own they protect things like logos and slogans product names business names and they do do and they do so very specifically in relation to certain goods or services then there's trade secrets which can kind of cover a little bit of everything especially in early stages so for instance trade secrets are a way to protect things before you patent them you keep them secret and then you will file a patent application on it trade secrets can also cover things that you know aren't going to be covered by patents copyrights or trademarks things like formulas and recipes and processes client lists um and you know and sort of know business know-how that's not going to be protected by patents copyrights and trademarks okay so what what is a patent basically what's the basic right of one and that's to exclude others from making using selling offering to sell or importing the invention into the united states and it's important to understand that this is not a right to actually do something so patent again does not give you the right to actually do something it's an exclusionary right and the example i typically give is let's say that you patent a formula of a pharmaceutical or a method of using a pharmaceutical to treat cancer that doesn't give you the right to actually do that you would have to go to the fda and get approval to use the drug in that sort of way so the patent doesn't actually give you the right to do those things okay so that's sort of the the right to exclude or the monopoly and that's sort of the first thing that people think about when it comes to patents but really that's one of the one of the least important things for most companies you know it's not all about enforcing rights it's not about having that monopoly so here are the other things that patents can do for so for instance licensing what you can do is you can allow others to use the patented technology and they'll pay you a royalty or they'll pay you you know upfront fees there's a lot of ways to structure that licensing can you know be totally varied it's really you know any way that you want to do it you retain the rights to the patent but then you give others the right to do it it could be exclusive or non-exclusive that would be licensing the patented technology you can also sell patents as well so that's where you would you would sell the patent that you own to another company it also creates book value in a company as well so that can be used as collateral for for loans or in valuation evaluation so for instance if you're looking for investors how much are you worth as a company to the investors patents are definitely a major part of that so you know aside from those things some of the most important aspects of having a patent or a patent application are these sort of soft benefits that a lot of times people overlook which tend to be the most important in early stages and for early stage companies so the first is a positive marketing purposes so it's going to be positive for attracting investors customers clients and even collaborators and employees patents and a patent application patent portfolio is a great way to mark your company as being innovative as being special and so it's really attractive to folks okay so on the other hand of that it's instilling fear in competitors so just being able to say you're patent pending or you have a patent a lot of times people don't understand what patent pending mean versus patented and you get a lot of benefit in scaring people off you don't even have to enforce your patent rights in order to kind of scare off potential competitors people say well you know it's patented or it's patent pending i i'm hesitant to get into the market you know with with those sort of similar products or technology okay so in addition you get protection against other people patenting similar things so when a patent application publishes or when a patent application issues as a patent it'll become public and these publications can be used against other people when they try to get a patent of their own on similar technology and i'll kind of go into this later on in the patent process but if so let's say somebody files a patent application on something that's really similar a patent examiner would look look at their patent application and they would be very likely to find your published patent application or issued patent that published and be able to reject that patent application saying it's not it's not new or it's obvious in view of prior including your published patent application or patent okay also there's the idea of sort of this ip arms race and so the best uh the best offense is a good defense and so the best way to ward off potential folks who may try to sue you who may have their own patent portfolio is having one of your own okay so it creates a situation where it's sort of the you know the nuclear option where there's mutually assured destruction if everybody sues each other with their patent portfolios so a lot of times these companies will say hey well let's cross license or maybe one company will buy another so the way you can set that up is by having an arsenal of your own patents or patent applications and that can ward off other folks who may have their own patents or patent applications okay so what does it take to get a patent so the main requirements are it has to be patentable subject matter and that's a lot of times fairly simple so you know is it a is it a book or is it a logo well no that's going to be copyrights or trademarks and i'll talk about it in in the next slide but these things that are sort of on the edge are things like abstract ideas and certain types of software so in addition to being patentable subject matter it has to be adequately described in the patent application that's usually a fairly low bar as long as you're working with a patent attorney you have to provide the right details usually not hard to provide it's usually not difficult to do that but you have to provide the right details it's something that you people a lot of times mess up if they try to file provisional or non-provisional patent applications themselves which i'll talk about a bit later on so if people try to do it themselves they don't provide the right details they don't provide enough detail and that can lead to patent applications being rejected so when it really comes down to where the rubber hits the road if you will in the patent examination process examined is going to determine whether the the claimed subject matter is new and non-obvious compared to prior and that's really where all the difficulty comes in the patent process typically that's where the rejections are and that's what either you know is going to make or break the patent application being allowed and potentially issuing as a patent so new or being novel is a question of is there one piece of prior art that totally describes your invention and that could be an issued patent it could be a published pending patent application it could be blog posts scientific papers uh youtube videos i mean really any sort of technology disclosure can be prior art okay so novelty a lot of times yeah there's not gonna be one thing that's exactly like what you have that's why obviousness tends to be really the difficult thing and so the the non-obviousness standard is would it be obvious to one of ordinary skill in the art that being your average person who works in the field to come to your invention knowing about all the prior that exists and the way it kind of works in examination is the examiner is going to find a bunch of prior art pull elements from and say well okay i found pieces of your invention here i found it here i found it here it would be obvious to combine those things pull all those pieces from this prior and come to your invention and that's the obviousness standard okay so what do utility patents cover really any sort of use useful things utilitarian things so it's mechanical devices software apps web services biotechnology electronics pharmaceuticals manufacturing methods games i mean really the list goes on so another thing i kind of want to talk about is there's a lot of bad information out there about ideas and software being patentable and so you know you'll see stuff online where people say no ideas are not patentable or software is not patentable and i will tell you that is absolutely untrue let me start with software and i'll say one thing is i saw i patent software day in and day out that's the bread and butter of what i do okay but it's all about the language that you use and this kind of gets a little bit technical look at some of my other videos about what patent claims are but so for instance you know i have this example here so you know you you you can't claim a s for instance a software product that performs functions x y and z that's going to be rejected that's you know that's going to be that subject matter eligibility where the examiners say no that's that's not eligible to be patented and will be totally correct so that application will be rejected whereas if you if you if you have a claim to say a computer configured to perform the functions xyz or a computer implemented method that includes the steps of xyz totally patentable okay so that's where the the this question of patenting software you know really kind of gets messed up by patent trees they probably provide the technical answer which is which sure is right that software itself is not literally patentable but aren't providing the good answer that yeah it's it's you can effectively easily patent software and related things that that's not a problem similar to ideas ideas can totally be patentable okay it's only things that are say abstract id ideas or just a formula or or just a a general idea without any details those things can't be patented really that doesn't answer most clients questions like folks come to me and they say hey i have an idea for this product it's going to have these things it's going to have these features and you can fill in the the specific details right remember that's one of the requirements is that you have to have it be adequately described a lot of times it's not that hard to fill in those details and so something that is you know maybe even a rudimentary idea that you know is maybe just sketches on paper that that can totally be patentable assuming those ideas can be filled in okay i mean i've i've definitely filed patent application off of nothing more than scribbles on a cocktail napkin so basic ideas can definitely be patented if you can fill in the relevant details one thing that can be kind of difficult is things like like business methods so things like related to marketing or pricing financial methods a lot of times you know those are seen as just sort of organizing human activity and you know can be rejected and it can be difficult to get those through maybe if it's done on a computer in some sort of special way but you know i really wouldn't worry too much about that stuff if you have something that's utilitarian that is an idea that's software related talk to a patent attorney and ask if it's going to be patentable that's the best way to know whether what you have is going to be patentable or not and a lot of times things that people don't think are patentable totally are going to be okay so let's talk about the two ways to start the patent process and this is going to be really important when planning patent strategy so deciding what application you're going to file first to start the patent process is really critical and if you don't do it the right way you set yourself up for failure early on okay so on this first line here you're going to see you can start with what's called a non-provisional patent application okay so you have an idea you draft and file this formal non-provisional patent application it waits in line for say one to three years at the patent office before examination begins and really that's just you're waiting in line it's a government things are really really slow and the line that you're sitting in is one to three years long that's the only reason why it takes one to three years for examination to begin okay so one of the things to know about this non-provisional application it's the formal application that has to have the formal line drawings has a long detailed description and has to have claims and is going to be typically an attorney drafted sort of you know sort of work product if you're doing it the right way okay so this is really expensive a lot of times it's going to be ten to eighteen thousand dollars to draft and file this application which you know as i'll kind of get to doesn't make very much sense for early a lot of early stage companies okay so getting back to it so far the non-profit waits in line for one to three years examination process begins and that can be months and sometimes another several years of back and forth with the examiner until hopefully the examiner allows the case you pay an issue fee and then it issues as a patent okay so a good way to think about the examination process is it's like any sort of negotiation think about pawn stars or american pickers where you're going to go in with an offer of claims that you know isn't quite what you're entitled to and the examiner is then going to have to you know you're going to negotiate and the examiner is going to say well you know you're not in quite entitled to quite such you know broad claim scope and then you have to kind of come together where you're getting over that hurdle of patentability and hopefully you're getting the broadest claims scope so a negotiation during examination is actually a good thing that's how you get the broadest patent possible okay so that's starting with a non-provisional patent application like i said they're really expensive you know you're paying ten to eighteen thousand dollars a draft to file these things and then you have additional costs the back and forth with the examiner that the attorney has to be involved in that can be thousands of dollars for each response and there can be you know sometimes two three four or more of these responses that your attorney is going to do which is a lot of cost so if only there was a way that you could sort of defer these costs a bit and luckily there is and that's the second uh way to start the patent process and that's the second one down below here so it's starting with what is called a provisional patent application and generally you know you can see that the the process is fairly similar so you have an idea then you'll draft and file this provisional patent application so the nice thing about provisional patent applications is they don't have all these formal filing request requirements it's a it's a document that a lot of times and this is what i do with clients is i will have them draft an invention disclosure that i will then scrub and remove limiting language from do some basic formatting we'll file that as a provisional patent application that can be in the thousands of dollars instead of you know 10 000 and up and can be an easy way to get patent pending status okay so the provisional application it's just a placeholder it only lasts for one year it automatically expires at the end of the year and that term can't be extended that's when you then have to file a non-provisional patent application that claims priority to that provisional application okay and then really the the process is about the same so you know non-provisional waits in line for one to three years before examination begins examination begins and there's a negotiation with the examiner hopefully the examiner allows the case you pay an issue fee and then it issues as a patent so i'm going to get into this a little bit later but it's this can be really important and pretty you know standard in a lot of ways for startups and small companies because with the provisional it can be cost-effective way to get patent-pending status and it gives you a year to do market testing to do r d and then you can add more details at the non-provisional stage another thing we can you can do is and we'll do this frequently is let's say you file the provisional and six months later you come up with all sorts of new things you want to get a priority date for that we'll just file an updated provisional six months down the road and then at the year anniversary from the first provisional we'll file the non-provisional and then maybe even have more updates that's a really great great way to incrementally protect ideas as you're going along as you're doing r d as you work with investors and you know realize that some things work and some things don't that can be really important to sort of you know be able to incrementally protect something instead of just you know say if you were to start with the non-provisional then you would have to file a whole new application every time you come up with something you don't have this you know this window of opportunity to to update things and sort of get uh incremental uh protection along the way okay so let's talk about uh patent strategies of different folks i usually put it sort of into three different buckets one is going to be large patent portfolios and these are folks who are i mean they're refining thousands of patent applications a year if you know hundreds you know sometimes maybe on the low side but it's these are large large patent portfolios the amazons ibm samsung's microsoft's of the world folks like that okay then there are startups and i'll kind of talk about what you know how i define startups um they're sort of growth companies who rely on investors to to grow and they're going to be different than individual in inventors and small consumer products this is going to be maybe it's a you know a large business or a business that has a lot of a lot of products but for small products that themselves don't like make you know don't have a lot of revenue associated with them the the strategy for protecting those things can be very different um just because it's you know you're doing different things than say a startup would same with individual inventors you know who aren't looking to grow and scale they have different needs than startups okay so let's start with the large patent portfolio and and see how we do that okay so you know with with my clients i i work with clients of all sizes whether they be fortune 100 companies startups shark tank companies individual inventors and i deal with all sorts of technology so i have experience with all of these types of clients now you may not be a large company you know like ibm or lg or intel but it's so important to understand their patent portfolio and how that difference differs from what you are going to be doing and why okay so like i said i mean these are folks who are filing say 50 you know 100 if not thousands of patent applications per year and a good way to think about it it's kind of like angel or vc investing and for those of you who aren't really familiar with how angel or vc investing works is they invest in a ton of companies and let's say for instance they they invest in 20 companies they know that the vast majority are going to fail let's say you know 10 out of 20 are totally going to fail they're going to lose their investment on that okay maybe there's going to be another say five companies who are going to maybe break even all right they won't lose their money but they're really not going to make any money then there's maybe 4 out of 20 that maybe they'll do okay they'll make a little bit of money but they're not going to be huge home runs it's really only going to be that one in 20 companies maybe even less that's really the big home run that's the million billion dollar company that really makes these investors a lot of money and that's how these big patent portfolios are kind of created as well you file on you know all sorts of ideas whether they're going to be commercial products or not whether there's just general ideas in in the technology space of the company you file on everything okay so you know you file everything knowing that a lot of stuff is going to be worthless you're just going to lose your money these are going to be you know patents that you know nobody really uses nobody cares about some are going to you know some are going to make a little bit of money whereas it's only going to be maybe the one in 21 and 50 patents it's going to be the million dollar billion dollar patent that really makes a an amazing patent portfolio okay so with these companies they're going to start the patent process with non-provisional patent applications typically they don't need to waste the time and money on a provisional patent application they have the budget just to file the non-provisional they come up with new updates fine we'll file a new non-provisional that that's not a big deal okay so with with with these sort of companies budget is definitely less of an issue and like i said so you just file on everything you file as soon as possible it doesn't matter whether you are you know actually going to be launching the product obviously you would want you know file something before you launch a product and i'll talk about this later on that you lose patent rights upon public disclosures public user office for sale if you don't file a patent application and so they'll certainly do that but a lot of times you know it's you know you invent something file a patent application um and you know and you do that on an ongoing basis all the engineers in the company are finally invention disclosure forms and you're essentially mining new inventions for patents all the time okay and so when you're drafting these applications and going through the examination process it's a focus on high quality enforceable patents and so a lot of times it it makes sense to drag out the examination process you can take a long time and that's okay you want to really negotiate hard to make sure that you have the broadest patent scope possible that's what these companies really want because they want them to be enforceable they want to be able to license them they want to be able to enforce them against competitors so they really want to make sure they're solid assets okay this is important for say like i said cross licensing um defending against people if you need to you know file a lawsuit a counter lawsuit with your patent portfolio or if you need to enforce against somebody who's copying what you have um and for for companies like this the strategy really stays the same the whole time it's not really all that different like i said you're just churning out new patent applications all the time that the inventors are coming up with new stuff and you file patent application just one after each other okay so that's large companies now startup patent portfolio strategy is is is very different so startups are early stage growth companies that scale with investors okay and this these can be companies that are at you know any stage in that process whether it's a friendly self-funded or friends and family funding or you have a seed round where you get a little you know a little bit of capital series a round but really it's going to be a company that's going to grow and then is ultimately going to have some sort of exit strategy right that's going to be being acquired by a company going public something like that and it's going to be an exit where these investors are going to be able to get a return on their investment these are typically not companies they're just going to you know perpetuate and you know be companies ongoing a lot of times they're going to have an exit although sometimes that ends up being the business strategy where these companies you know will just stay in business and don't you know don't go public or or don't actually sell to another company okay so a lot of times these can be small patent portfolios maybe one to ten patent applications per year maybe more than that but a lot of times it's really not that many and for startups i mean you know regardless of where you are on that spectrum of of the lifecycle of a startup budget is always always a concern and that's why i enjoy working with startups the most is because you always have to really do this bespoke work and really be cognizant of the the budget that folks have and be able to scale with that budget in the beginning you have to be really really budget conscious and then you have to you have to leave open options so you can expand the portfolio once you get more capital and then be able to expand it more once you get additional capital that's the fun of working with startups is that it's always changing budget is always a concern and you know worrying about how to craft it for for investors things like that so with with startups they're typically going to focus on protecting the core uh products or or business methods that the that the company has they don't have the budget and the luxury to be able to just patent general sort of white space patenting things around you know their product in the general technology or a lot of times it's going to be fairly focused on their products and a lot of times it will focus on you know the new products they come up with more detail they have in the products that's how you tend to expand the patent portfolio of startups and you have to with with startups you have to sort of build in the ability to scale the patent portfolio with their growth okay that's that's kind of a concern you you want to you know have a lot of description in there so you can file a single big application but later on split that off into continuations and expand the patent portfolio it's a bit sort of out of the scope of this video but i have some good other videos that talk about that sort of strategy of how to scale a patent portfolio as startups grow so the biggest thing with startups is deferring cost and maintaining flexibility that is really really important so you know the name of the game is you know wait as long as you can to file patent applications it's kind of counter-intuitive but it makes a lot of sense to only file when you're about to make public disclosures public uses or office offers for sale or when you're about to uh approach investors that's typically the best time to file patent applications you want to file your provisional patent application then because that defers the you know the time you know of a year that then you have to file that really expensive non-provisional also defines the cost related to the examination process which is also going to be expensive so for startups it's better to wait and delay all of those costs wait until you have more certainty around the product around the market and of course until you have more budget whether it's from investors or actually having sales things like that it's important to make sure you have that capital so you can probably scale the patent portfolio okay so in addition to deferring costs and maintaining this important flexibility you want to craft a patent portfolio for startups to attract investors that's one of the key things about startups is the ip is not really used for enforcing against other folks you know a lot of times startups don't have the bankroll to file patent lawsuits or it's it's typically a a fairly new landscape with new products and there's really there may not even be competitors out there competitors may come in later so the enforcement and having a monopoly really isn't a concern what a concern is is creating a patent portfolio that has good optics and that is is good for marketing to attract investors or other collaborators you know whether they be you know if folks are going to give you grants it's going to be employees it's going to be customers things like that you want to craft a patent portfolio that's going to be attractive to those folks okay so and like i said you're almost always going to be starting with a provisional patent application again that's that's the best way to defer all those costs related to the the expense of non-provisional and related to the uh to the examination process okay so then individual inventors and small consumer products so this is going to be maybe an individual or a small group that doesn't really need investors to grow they can manufacture these products themselves or maybe you know they can you know do it offshore in a factory or something but they but they don't really need investors in order to scale the company okay so you don't have this issue then with having to to attract investors but in a lot of ways the the issues with these sort of companies or with these sort of individuals is fairly similar to to startups okay and and to be honest for a lot of these folks patent applications may not be really be worth it with with startups the optics of having patent applications is extremely important and almost essential you almost have to file patent applications that's how you get traction that's how you get investors it's a key part of the startup life lifecycle whereas for small companies and you know ones where you know they don't necessarily need it for the marketing and optic purposes um you know it may not make a lot of sense to file a patent application at all you know like i said you know it's going to be tens of thousands of dollars a lot of times to get all the way through the examination examination process and if a product really isn't going to have revenue that's going to be more than that it may not make any sense to even file a patent application and that's something that i try to consult on with folks with small products is thinking about well does it even make sense to do this why are you filing a patent application here you know if you're trying to go into it in you know trying to you know be able to enforce a patent you know for small companies that can be really really difficult even startups with a decent amount of capital don't usually have the funds to be able to support big patent litigation they can't even do it it's really difficult for small folks to enforce patent rights but if they're looking for um say patent pending status or patents to scare off competitors or for positive marketing benefits that can be really useful and it can make then a lot of sense to file patent applications okay that can be one of the biggest benefits for those folks but if they're going into it thinking you know hey i want to build in forces that's that's the only thing i'm going to be able to use this patent for you know you may need to think about the return on investment that patents are actually going to give you okay and i want to talk about some issues with sort of these business plans that a lot of folks may have related to just pure licensing or or patenting stuff and selling patents okay so it kind of comes down to the value of ideas so honestly there's very little value in in bare ideas a lot of it is in the execution of the ideas and patenting and and getting value out of uh just bare ideas is you know it's it's really difficult to sell ideas and and and and products that are really complex you know maybe if something is really simple like if you could you know go to home depot and make a prototype or you have stuff around the house where you can make a prototype it's it's really easy to to create and really easy to demonstrate you know then it may you know then it may be totally possible to license or sell something like that the example i always give and you know or the resource that i always refer to folks is as you can see on the slide is stephen key's one simple idea his his book is the number one resource that you know as far as that i've found as far as uh learning how to license and sell ideas and simple inventions um there's definitely a lot to it it's not just something that's really simple like oh yeah i'm just going to go off and i'm going to sell my ideas there's a it's really difficult to do but you can learn how to do it and people can be successful at doing it part of it is picking the right ideas learning how to appropriately approach companies what companies to actually approach um it's you know you can learn those skills but for ideas that are really complex a lot of times that's going to be difficult if not impossible i have folks who come to me all the time say hey i have this idea for a new cell phone app um and i want to go to google and i want to you know i want to tell them about this you know this new website idea or this new app idea things like that it's like well you know a lot of times there's not going to be a lot of value in something like that because the difficulty isn't actually executing that and i think a lot of people don't appreciate how difficult it is to take something from a kernel of idea to do web development to create these things and it can take huge teams of people many years to do it and so folks like google are gonna look like that and be like well yeah i mean okay that's an interesting idea but you know where's the team that's actually going to execute this idea you know i we we you know the value ideas become we we don't we come up with these ideas all the time the value isn't in the idea it's in the execution if you're not a person who can actually execute those things there's really not going to be much value in those things okay so also with you know if for folks who want to patent something and sell issued patents that is extremely extremely risky and not something i recommend as far as a business model goes you know i i think that folks should try to sell things when their their applications are just pending and to be honest if if you don't get traction with selling an invention while a patent application is pending it's very unlikely that you're gonna you know sell it even when it's patented that doesn't really make as much of a difference as you would think a lot of my clients they sell ideas they sell companies they get tons of traction just when things are patent-pending so having an issue patent isn't really you know isn't really important and for the folks who want to go through the whole patent process spend tens of thousands of dollars that's a lot of money to spend that's a lot of risk to take on and it's a long time frame so you know people who i i really don't recommend you know these business plans where people want to just patent something and then try to sell the issued patent a lot of times that's a recipe for for disaster okay so i want to talk about patent and prior art searching and it's a big misconception but patent and prior articulation is not a standard part of the inventing and patent drafting process okay people always think hey and it kind of it's kind of counterintuitive you would think that okay well you know if i'm going to file a patent application i want to know whether it's going to be patentable by doing a prior art search okay and the rationale here is like well so the patent examiner is going to do their own prior search and determine whether the idea is new and non-obvious compared to the priority i should go and i should figure out what the priority is and determine patentability and whether i should even file this patent application surprisingly the value of doing a prior art search and doing it right and having an attorney do it or a search company do it your return on investment is going to be really really low and doesn't typically result in actionable information i mean a lot of times i can draft these uh these letters you know the prior art analysis letters before you even do the analysis okay it's typically going to be hey we found some things that are similar it's hard to tell whether this is you know one examiner or not is going to think that this is you know think this is allowable there's a lot of hidden priority out there and you know we don't really know that's you know 98 of the prior searching that comes back is going to be in that boat you're not going to have anything actionable it's going to be like well let's just file the application which is typically the better thing to do so a lot of it is there's a misconception that you know patents are a binary thing that's either having a patent or not but really patents provide it can provide a spectrum of protection you can have patents that are really broad that cover a lot of different variations or you can have patents that are so specific and so narrow to one very very specific product that they're effectively worthless in the sense that it would almost be impossible for somebody to happen to have a product that was so specific and exact like that's exactly like that or it'd be super easy for them to make some tiny little change and design around that patent okay so that's that's sort of the thing is it's not just you know it's patentable or it's not it's a question of where on that spectrum is it going to be are you going to get be able to get a broad patent is going to have to be really narrow a lot of times you're not going to know where that's going to be even if you do a private search it depends on the exam you get one examiner's gonna say oh yeah this is totally patentable you know i'm gonna give you a really broad patent and it's gonna be really easy for you where's another exam and say well i found a bunch of prior art and i think it'd be obvious to combine you know all of these pieces of prior i can find all the elements of what you have there i'm not going to even let you have a patent at all or i'm going to maybe i'll let you have one but it's going to have to be so narrow and so specific it's going to be effectively worthless you really don't know until you get into examination patentability is definitely in the details of things too so you know people do a prior search on some sort of broad concept it doesn't really do you much good because you don't a lot of times have the specific details of what the product actually is and if you do something a little bit different it may be patentable or you do something different and it may not be patentable it's it's sort of cart before the horse it's better to you know actually create the product and you know maybe then you would do the prior search but then you've already created the product it's better than just to file the patent application so it's it's very card for the cart before the horse you don't have the details when you want to to do the prior search that could actually give you actionable information um you know it typically is better to just file your patent application and let the examiner frame the issues that's the better way to go about it don't spend all the time and all the money on doing some sort of speculative prior art search that doesn't really help you another thing to realize is that a lot of patents are patents and pat or patent applications are held in secret by default for 18 months okay so you could do a prior search but there could be prior that is right there that you know totally is relevant to what you're doing but when you do the search it's it's hidden from you okay so the default is 18 months from when they file the patent application that can be all the way up until the application issues as a patent so there's always going to be this huge blind spot of prior art that you're not going to be able to find it's going to be hidden to you okay so it's another reason why you know it just doesn't make sense to spend all the money and time doing these things um and if and and if you ask me it's a way that patent attorneys upsell upsell their clients they use the fear and people assume it's sort of a standard part of the application process to do this prior essentially to say of course i'll take your money and let's do some patented prior art searching sounds good to me i'm not a big fan of doing that because that doesn't set companies up for success you know only in rare cases where you are going to get a return on investment do i suggest doing patent or prior art searching but when it comes down to it you know honestly especially for for startups and this is going to sound crazy but patentability does not matter let me say that again it doesn't it doesn't really matter a lot of time whether the invention is ultimately patentable and that may sound totally insane to you but let me kind of go back to the patent process again so you file the provisional application it's a year before you file the non-provisional patent application it'll be another one to three years before examination begins and that examination process could be months if not you know years until you get to a final determination that okay this isn't patentable all right so you are you are patent pending during that whole time all right so i've had a lot of clients who they have they have gotten substantial traction by getting big investors closing multiple rounds with investors they have even made x's where they've sold the company or you know or you know somehow you know gone public or something before their patent applications are even issued okay so a lot of times that issue of whether it's patent or not isn't relevant to ultimate success and i've even had folks who end up abandoning their patent applications because we're like look we made the money we want we're getting market traction we don't really need this you know the investors for some reason don't care about it and it it doesn't even matter whether something is patentable okay so you know it that's one of the big misconceptions you know you have to have patents it has to be patentable we need to know that up front it doesn't usually make a difference just file the patent applications that's what's important to investors that's what's important to get you traction not ultimately a lot of times whether it's patentable or not okay the exception though is for simple products where you're really focusing on a single point of novelty things that you know don't have a lot of complexity that's where some prior searching can be useful and i'm not saying that there aren't a few cases where i would recommend doing it but the vast majority of clients that i work with honestly i can't remember the last time i did a patent or prior search as i can't remember you know the last time when you know i wasn't surprised you know when i when i was surprised by the prior that came out was like oh my gosh you know i didn't think that there was going to be stuff like out like that out there there's always going to be prior that's going to be relevant and that's going to be similar it's usually more an issue of you know where you are in that spectrum of protection are you going to be able to get a broad patent or you're going to be able to get a narrow patent that's usually where you fall and so you know a lot of times you know we forego patent searches i mean i would say in 99 of the cases we don't do patent searching at all it makes more sense just to file the patent application another thing to note is that you know this is not the same as market research and i am absolutely not saying that you should not look at other products and not know what's going on in a competitive landscape you know even understanding what other competitors are doing in terms of patent portfolios how they're structuring patents things like that that can be really valuable information but doing all this analysis to determine you know whether your invention is patentable or not whether we should file patent applications that should not be a part of the patent application process but it should absolutely be part of sort of the market analysis uh part of of the business that can be really important and essential in a lot of ways especially when you're pitching to investors they're going to want to know what the competitive landscape is they're going to want to know hey what are other people doing in the in in the field you know what are their products like are they patented they're probably going to want to know those things but again you don't need to do the analysis of whether your invention is patentable or not that's typically not not important okay so it's important to understand the difference between patentability and infringement and what i was just talking about was patentability the question there is are the patent claims in an application new and non-obvious in view of the prior art okay so it's pending applications based on prior art that that that's where you're thinking about patentability okay infringement is something totally different infringement relates to issued and enforceable patents and relates to actual products so the question here is does the accused product or process have all the elements or equivalents of at least one claim of the issued and enforceable patent okay so one thing to note here is that it's only products are actually performing certain methods that's what infringes you know you can have a patent application a patent application does not infringe an issued patent okay writing an article does not infringe on on a on an issued patent it's only when you perform specific methods or you have specific products that meet the elements of the claims of that patent that's when there's infringement and what people will then ask is well hey i'm you know i have this product should i do an infringement analysis to determine whether i'm infringing on somebody else's patents and you know again that's a kind of a you know a natural thing that people would think is something that you would want to do it's like well hey you know i don't want to go out there i don't want to have this product where i'm going to be shut down because i'm infringing on somebody's uh somebody else's patent but strangely enough and counter-intuitively this is not a standard part of the inventing process or part of you know drafting and filing patent applications infringement analysis is absolutely not part of that and strangely enough you know again you don't you don't get you get really low return on investment from all the time and effort you spend on it the the nature of the analysis is really expensive and time-consuming and difficult which you know comes down to you know it being really really expensive in terms of attorney time and a lot of times you know you're really not going to get good actionable information okay so infringement is in the details of the final final product that's what's in really important to understand if you have a general idea for a product you can do this broad patent search but it's going to be in the details of how you actually implement that product or methods related to it and how they compare to the very specific claims of somebody else's issued patent that's where the analysis is and so you can try to do this analysis early on but you're not going to get very good actionable information because you don't have the specifics of the product to compare to the patent claims plus if you're doing this sort of this big broad search you know i mean you're looking at thousands of dollars it's not tens of thousand dollars to do this general search and all this analysis and it's so speculative because you really don't know what your final product is okay also keep in mind you know these applications are secret for 18 months um and potentially all the way up until the patent application issues so you could be doing this infringement analysis you know on pending applications and issued patents but something that's totally relevant could totally you know be hidden from you you may not know it even exists so there's still going to be a huge blind spot even if you're doing you know some sort of uh you know doing some sort of infringement now so you can never know for sure also even if you find patent applications that seem to be relevant those patent applications may never issue as a patent the the you know the the the patent applications they may be rejected and the uh the folks may not be able to get over the rejections or they may just run out of money and give up okay so you know you find these patent applications that are relevant they may never even issue a patent as a patent and may never even be enforceable also keep in mind that the cost to enforce patents is really really really high and so even if you would theoretically infringe on a patent somebody would have to file a patent lawsuit they would have to file an attorney it's a very expensive thing to do and a lot of times people don't have the resources to file a patent application you know unless you know they can have it done on contingency and there's for sure infringement usually infringement isn't a clear-cut thing it's going to be in the gray area and you're going to have good you know non-infringe non-infringement defenses and even in validity defenses that's typical and so you know it it can it can be easy to you know a lot of times shut those sort of lawsuits down so you know the cost to enforce stuff is really really high and so even if you do theoretically uh infringe on something it's not likely that you're actually going to be sued on on the other side of that is let's say you do this big analysis and you say hey we're not infringing any of these patents it doesn't mean you're not going to still be sued i mean i've dealt with litigation where you know people have definitely not been infringing and the people on the other side say well hey we disagree we'll see in court we're going to take this to the very end and it becomes a business decision where it's like well let's just pay these people off they want a small settlement why drag this out this is part of their business plan on you know kind of extorting money out of people with patents and even if there's not really good really good case for infringement a lot of times people can extort money out of people so it doesn't mean that you're going to be free from these infringement lawsuits okay so a lot of times you know just create the best product that you can and if you happen to be one of the rare people who gets caught up in sort of some sort of patent litigation one realize that you know it's it's it's totally rare you you kind of won the crappy lottery but the same time at least you're on somebody's radar as a successful company that's a good problem to have you know a lot of times people aren't even on anybody's radar they wouldn't know you know what you're doing whatsoever okay there's there's an exception for a targeted analysis if for instance you have a there's one competitor that you are really aware of and you know about specific patents then it can make sense if it's if it's really targeted to a specific patent or maybe a specific competitor especially if for instance you you are really using a lot of what they're doing as inspiration um you may want to be really careful about what you're doing and if you know that you're trying to design around certain products or patents then you may want to do some sort of infringement analysis and it can make sense a lot of times for larger companies who who know that they're going to be devoting a lot of money to these products so for individuals who have a small product you know it's it's it's prohibitively expensive to do this sort of analysis you know a lot of times you know doing the search is going to be you know as much as is probably your revenue for you know for a long period of time so you don't get a good return on investment also for startups well you know they don't necessarily know what their product is initially they don't have the the money to do these sort of analyses i want to finish off with talking about the early stage issues and these are some of the most important things that you need to know when it comes to inventing and developing ideas the first is you have to understand that you should not make public disclosures public uses or offers for sale until you file a patent application so patent might start to be lost upon a first public disclosure public use or offer for sale in nearly all foreign countries you automatically lose your rights upon a first public disclosure public use or offer sale in the u.s and some foreign jurisdictions you have a a one-year grace period or maybe a six-year grace period where you know you have to file a patent application within that time period otherwise you lose your rights but a lot of times you automatically lose your right so the so the best way to do it is file you a patent application again before a first public disclosure public use or offer for sale all right you should also file be taught before talking with investors and a lot of times this isn't going to be considered a public disclosure public use are for sale that's going to forfeit patent rights but it really improves your pitch with investors okay so you can go into the pitch meeting saying hey we're patent pending and you can be more open and talk to them about the technology that can be really important okay it makes you know it makes things a lot more comfortable it improves the the pitch substantially what you don't want to do is go in and say well hey you know we're gonna file patent applications i can't talk about this i want you to sign an nda and you know hopefully you know this but that is totally pegs you as a newbie who doesn't know what they're doing in the eyes of investors they're gonna look and be like hey we we don't want to work with you you know this is this is not a legit company um that you know they're they're you know they don't understand how things work okay so you know you you ideally then should just hey file a patent application go in be able to say your patent pending all right so you got to understand that the us is no longer a first to invent system and you would think that that would mean hey we need to rush and file patent applications immediately but like i said earlier on that's not the case a lot of times it makes more sense to wait and file defer the costs related to filing that initial provisional application to filing the non-provisional a year later to the examination process so again there's the it's the four triggers public disclosures public uses offers for sale and before you're going to approach investors that's typically when i recommend folks actually file patent applications okay and this one is really really important probably one of the most important things that i'm going to talk about is that inventors must affirmatively assign their patent rights to a company okay so just by being an employee just by being a partner in the company or you know being a contract contractor things like that that does not automatically mean that those inventors are required to assign their patent rights and what can happen is you file a patent application this person says well i never assigned my patent rights we don't have any employment agreement or any sort of any sort of contract or you know in a collaboration group that says i assign my rights i'm going to hold on to this and then you effectively you know lose control over the patent that person owns a share of the patent and they can go out and they can you know they can license the technology around your back without your permission okay so you lose control and obviously that is really unattractive makes you radioactive in the eyes of investors you want to make sure that you don't do that it's really easy to protect yourself all you have to do is in any sort of agreement you have again whether it is employment agreement a collaboration agreement partnership agreements that all patents and ip that's generated goes to the company you just have a clause that says you know i hereby assign my you know my rights in any uh in any patentable subject matter to the company it's usually a pretty simple clause talk to your attorney about it but usually it's pretty simple but you have to have that in there before you start collaborating with people okay so with all these things talk to a patent attorney early so you know you have a software product or you have a uh you have an idea is that patentable talk to the patent attorney a lot of times it can be free or it can be really really cheap to do an analysis and to plan out a strategy about hey is this patentable am i ready to file a patent application on this okay talk to a patent attorney early it makes a lot of sense just to make sure that you're not you know forfeiting your patent rights but inadvertently doing something like public disclosures public user offers for sale that are going to forfeit your patent rights and that it's very goldilocks you know you want to make sure that you're filing at the right time you're not filing too early but you're not filing too late okay so thanks for watching and check out some of these other videos um i got a couple of other ones here that are going to be really good additions to this thanks for watching and we'll see you again in the next video thanks"
  }
}